; ModuleID = 'xdp_balancer.c'
source_filename = "xdp_balancer.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.binds_row_key = type <{ i32, i16, i8 }>
%struct.bpf_fib_lookup = type { i8, i8, i16, i16, %union.anon.1, i32, %union.anon.2, %union.anon.3, %union.anon.4, i16, i16, [6 x i8], [6 x i8] }
%union.anon.1 = type { i16 }
%union.anon.2 = type { i32 }
%union.anon.3 = type { [4 x i32] }
%union.anon.4 = type { [4 x i32] }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.tcphdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }
%struct.udphdr = type { i16, i16, i16, i16 }
%struct.packet_context = type { i8*, i8*, i32*, i16, i16, %struct.iphdr*, %struct.ipv6hdr*, %struct.ethhdr*, i32, %struct.iphdr*, %struct.lb_gue_hdr*, %struct.udphdr* }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.lb_gue_hdr = type { i8, i8, i16, i16, i8, i8, [2 x i32] }

@tx_ports = global %struct.bpf_map_def { i32 14, i32 4, i32 4, i32 64, i32 0 }, section "maps", align 4, !dbg !0
@config = global %struct.bpf_map_def { i32 2, i32 4, i32 8, i32 4, i32 0 }, section "maps", align 4, !dbg !166

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "tx_ports", scope: !2, file: !168, line: 17, type: !169, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (Red Hat 13.0.0-2.el9)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !56, globals: !165, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_balancer.c", directory: "/home/conor/Workspace/College/fyp/src/balancer-xdp")
!4 = !{!5, !14, !45}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 5326, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 40, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!41 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!42 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!43 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!44 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 5935, baseType: !7, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55}
!47 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_SUCCESS", value: 0)
!48 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_BLACKHOLE", value: 1)
!49 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_UNREACHABLE", value: 2)
!50 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_PROHIBIT", value: 3)
!51 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_NOT_FWDED", value: 4)
!52 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_FWD_DISABLED", value: 5)
!53 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_UNSUPP_LWT", value: 6)
!54 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_NO_NEIGH", value: 7)
!55 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_FRAG_NEEDED", value: 8)
!56 = !{!57, !58, !59, !60, !76, !81, !100, !108, !73, !124, !157, !77, !160, !162, !163}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!58 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !62, line: 165, size: 112, elements: !63)
!62 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!63 = !{!64, !69, !70}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !61, file: !62, line: 166, baseType: !65, size: 48)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 48, elements: !67)
!66 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !{!68}
!68 = !DISubrange(count: 6)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !61, file: !62, line: 167, baseType: !65, size: 48, offset: 48)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !61, file: !62, line: 168, baseType: !71, size: 16, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !72, line: 25, baseType: !73)
!72 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !74, line: 24, baseType: !75)
!74 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!75 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !78, line: 24, baseType: !79)
!78 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !80, line: 38, baseType: !66)
!80 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !83, line: 86, size: 160, elements: !84)
!83 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!84 = !{!85, !87, !88, !89, !90, !91, !92, !93, !94, !96, !99}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !82, file: !83, line: 88, baseType: !86, size: 4, flags: DIFlagBitField, extraData: i64 0)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !74, line: 21, baseType: !66)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !82, file: !83, line: 89, baseType: !86, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !82, file: !83, line: 96, baseType: !86, size: 8, offset: 8)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !82, file: !83, line: 97, baseType: !71, size: 16, offset: 16)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !82, file: !83, line: 98, baseType: !71, size: 16, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !82, file: !83, line: 99, baseType: !71, size: 16, offset: 48)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !82, file: !83, line: 100, baseType: !86, size: 8, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !82, file: !83, line: 101, baseType: !86, size: 8, offset: 72)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !82, file: !83, line: 102, baseType: !95, size: 16, offset: 80)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !72, line: 31, baseType: !73)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !82, file: !83, line: 103, baseType: !97, size: 32, offset: 96)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !72, line: 27, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !74, line: 27, baseType: !7)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !82, file: !83, line: 104, baseType: !97, size: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !102, line: 23, size: 64, elements: !103)
!102 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "")
!103 = !{!104, !105, !106, !107}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !101, file: !102, line: 24, baseType: !71, size: 16)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !101, file: !102, line: 25, baseType: !71, size: 16, offset: 16)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !101, file: !102, line: 26, baseType: !71, size: 16, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !101, file: !102, line: 27, baseType: !95, size: 16, offset: 48)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lb_gue_hdr", file: !110, line: 51, size: 128, elements: !111)
!110 = !DIFile(filename: "./../common/gue.h", directory: "/home/conor/Workspace/College/fyp/src/balancer-xdp")
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !109, file: !110, line: 53, baseType: !86, size: 2, flags: DIFlagBitField, extraData: i64 0)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !109, file: !110, line: 54, baseType: !86, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "hlen", scope: !109, file: !110, line: 55, baseType: !86, size: 5, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "proto_ctype", scope: !109, file: !110, line: 56, baseType: !86, size: 8, offset: 8)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !109, file: !110, line: 57, baseType: !71, size: 16, offset: 16)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "reversed", scope: !109, file: !110, line: 60, baseType: !73, size: 16, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "next_hop", scope: !109, file: !110, line: 61, baseType: !86, size: 8, offset: 48)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "hop_count", scope: !109, file: !110, line: 62, baseType: !86, size: 8, offset: 56)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !109, file: !110, line: 63, baseType: !121, size: 64, offset: 64)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 64, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 2)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !126, line: 117, size: 320, elements: !127)
!126 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "")
!127 = !{!128, !129, !130, !134, !135, !136, !137, !156}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !125, file: !126, line: 119, baseType: !86, size: 4, flags: DIFlagBitField, extraData: i64 0)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !125, file: !126, line: 120, baseType: !86, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !125, file: !126, line: 127, baseType: !131, size: 24, offset: 8)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 24, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 3)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !125, file: !126, line: 129, baseType: !71, size: 16, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !125, file: !126, line: 130, baseType: !86, size: 8, offset: 48)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !125, file: !126, line: 131, baseType: !86, size: 8, offset: 56)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !125, file: !126, line: 133, baseType: !138, size: 128, offset: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !139, line: 33, size: 128, elements: !140)
!139 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!140 = !{!141}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !138, file: !139, line: 40, baseType: !142, size: 128)
!142 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !138, file: !139, line: 34, size: 128, elements: !143)
!143 = !{!144, !148, !152}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !142, file: !139, line: 35, baseType: !145, size: 128)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 128, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 16)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !142, file: !139, line: 37, baseType: !149, size: 128)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 8)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !142, file: !139, line: 38, baseType: !153, size: 128)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 128, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 4)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !125, file: !126, line: 134, baseType: !138, size: 128, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !78, line: 27, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !80, line: 48, baseType: !159)
!159 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !78, line: 26, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !80, line: 42, baseType: !7)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !80, line: 40, baseType: !75)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !78, line: 25, baseType: !162)
!165 = !{!0, !166, !177, !179, !181, !183, !186, !188, !192, !254, !256, !264, !278, !318, !325}
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "config", scope: !2, file: !168, line: 29, type: !169, isLocal: false, isDefinition: true)
!168 = !DIFile(filename: "./maps.h", directory: "/home/conor/Workspace/College/fyp/src/balancer-xdp")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !170, line: 138, size: 160, elements: !171)
!170 = !DIFile(filename: "/usr/include/bpf/bpf_helpers.h", directory: "")
!171 = !{!172, !173, !174, !175, !176}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !169, file: !170, line: 139, baseType: !7, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !169, file: !170, line: 140, baseType: !7, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !169, file: !170, line: 141, baseType: !7, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !169, file: !170, line: 142, baseType: !7, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !169, file: !170, line: 143, baseType: !7, size: 32, offset: 128)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "binds", scope: !2, file: !168, line: 41, type: !169, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "bind_backends", scope: !2, file: !168, line: 59, type: !169, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "hash_keys", scope: !2, file: !168, line: 69, type: !169, isLocal: false, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "source_mac", scope: !2, file: !185, line: 19, type: !65, isLocal: false, isDefinition: true)
!185 = !DIFile(filename: "./encap.h", directory: "/home/conor/Workspace/College/fyp/src/balancer-xdp")
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "gateway_mac", scope: !2, file: !185, line: 20, type: !65, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 251, type: !190, isLocal: false, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 32, elements: !154)
!191 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "stdin", scope: !2, file: !194, line: 137, type: !195, isLocal: false, isDefinition: false)
!194 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !197, line: 7, baseType: !198)
!197 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !199, line: 49, size: 1728, elements: !200)
!199 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!200 = !{!201, !202, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !217, !219, !220, !221, !223, !224, !226, !230, !233, !237, !240, !243, !244, !245, !249, !250}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !198, file: !199, line: 51, baseType: !59, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !198, file: !199, line: 54, baseType: !203, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !198, file: !199, line: 55, baseType: !203, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !198, file: !199, line: 56, baseType: !203, size: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !198, file: !199, line: 57, baseType: !203, size: 64, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !198, file: !199, line: 58, baseType: !203, size: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !198, file: !199, line: 59, baseType: !203, size: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !198, file: !199, line: 60, baseType: !203, size: 64, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !198, file: !199, line: 61, baseType: !203, size: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !198, file: !199, line: 64, baseType: !203, size: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !198, file: !199, line: 65, baseType: !203, size: 64, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !198, file: !199, line: 66, baseType: !203, size: 64, offset: 704)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !198, file: !199, line: 68, baseType: !215, size: 64, offset: 768)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !199, line: 36, flags: DIFlagFwdDecl)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !198, file: !199, line: 70, baseType: !218, size: 64, offset: 832)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !198, file: !199, line: 72, baseType: !59, size: 32, offset: 896)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !198, file: !199, line: 73, baseType: !59, size: 32, offset: 928)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !198, file: !199, line: 74, baseType: !222, size: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !80, line: 152, baseType: !58)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !198, file: !199, line: 77, baseType: !75, size: 16, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !198, file: !199, line: 78, baseType: !225, size: 8, offset: 1040)
!225 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !198, file: !199, line: 79, baseType: !227, size: 8, offset: 1048)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 8, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 1)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !198, file: !199, line: 81, baseType: !231, size: 64, offset: 1088)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !199, line: 43, baseType: null)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !198, file: !199, line: 89, baseType: !234, size: 64, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !80, line: 153, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !80, line: 47, baseType: !236)
!236 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !198, file: !199, line: 91, baseType: !238, size: 64, offset: 1216)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !199, line: 37, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !198, file: !199, line: 92, baseType: !241, size: 64, offset: 1280)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !199, line: 38, flags: DIFlagFwdDecl)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !198, file: !199, line: 93, baseType: !218, size: 64, offset: 1344)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !198, file: !199, line: 94, baseType: !57, size: 64, offset: 1408)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !198, file: !199, line: 95, baseType: !246, size: 64, offset: 1472)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !247, line: 46, baseType: !248)
!247 = !DIFile(filename: "/usr/lib64/clang/13.0.0/include/stddef.h", directory: "")
!248 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !198, file: !199, line: 96, baseType: !59, size: 32, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !198, file: !199, line: 98, baseType: !251, size: 160, offset: 1568)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 160, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 20)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "stdout", scope: !2, file: !194, line: 138, type: !195, isLocal: false, isDefinition: false)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !258, line: 170, type: !259, isLocal: true, isDefinition: true)
!258 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "")
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!58, !262, !98, null}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "bpf_xdp_adjust_head", scope: !2, file: !258, line: 1118, type: !266, isLocal: true, isDefinition: true)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!58, !269, !59}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 5337, size: 192, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !277}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !270, file: !6, line: 5338, baseType: !98, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !270, file: !6, line: 5339, baseType: !98, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !270, file: !6, line: 5340, baseType: !98, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !270, file: !6, line: 5342, baseType: !98, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !270, file: !6, line: 5343, baseType: !98, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !270, file: !6, line: 5345, baseType: !98, size: 32, offset: 160)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "bpf_fib_lookup", scope: !2, file: !258, line: 1814, type: !280, isLocal: true, isDefinition: true)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!58, !57, !283, !59, !98}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_fib_lookup", file: !6, line: 5947, size: 512, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !295, !296, !302, !308, !313, !314, !315, !317}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !284, file: !6, line: 5951, baseType: !86, size: 8)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !284, file: !6, line: 5954, baseType: !86, size: 8, offset: 8)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !284, file: !6, line: 5955, baseType: !71, size: 16, offset: 16)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !284, file: !6, line: 5956, baseType: !71, size: 16, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, scope: !284, file: !6, line: 5958, baseType: !291, size: 16, offset: 48)
!291 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !284, file: !6, line: 5958, size: 16, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !291, file: !6, line: 5960, baseType: !73, size: 16)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "mtu_result", scope: !291, file: !6, line: 5963, baseType: !73, size: 16)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !284, file: !6, line: 5968, baseType: !98, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, scope: !284, file: !6, line: 5970, baseType: !297, size: 32, offset: 96)
!297 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !284, file: !6, line: 5970, size: 32, elements: !298)
!298 = !{!299, !300, !301}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !297, file: !6, line: 5972, baseType: !86, size: 8)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flowinfo", scope: !297, file: !6, line: 5973, baseType: !97, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !297, file: !6, line: 5976, baseType: !98, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, scope: !284, file: !6, line: 5979, baseType: !303, size: 128, offset: 128)
!303 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !284, file: !6, line: 5979, size: 128, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !303, file: !6, line: 5980, baseType: !97, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !303, file: !6, line: 5981, baseType: !307, size: 128)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 128, elements: !154)
!308 = !DIDerivedType(tag: DW_TAG_member, scope: !284, file: !6, line: 5988, baseType: !309, size: 128, offset: 256)
!309 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !284, file: !6, line: 5988, size: 128, elements: !310)
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !309, file: !6, line: 5989, baseType: !97, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !309, file: !6, line: 5990, baseType: !307, size: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_proto", scope: !284, file: !6, line: 5994, baseType: !71, size: 16, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !284, file: !6, line: 5995, baseType: !71, size: 16, offset: 400)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !284, file: !6, line: 5996, baseType: !316, size: 48, offset: 416)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 48, elements: !67)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !284, file: !6, line: 5997, baseType: !316, size: 48, offset: 464)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !258, line: 49, type: !320, isLocal: true, isDefinition: true)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!57, !57, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !258, line: 1294, type: !327, isLocal: true, isDefinition: true)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!58, !57, !98, !330}
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !74, line: 31, baseType: !159)
!331 = !{i32 7, !"Dwarf Version", i32 4}
!332 = !{i32 2, !"Debug Info Version", i32 3}
!333 = !{i32 1, !"wchar_size", i32 4}
!334 = !{i32 7, !"PIC Level", i32 2}
!335 = !{i32 7, !"frame-pointer", i32 2}
!336 = !{!"clang version 13.0.0 (Red Hat 13.0.0-2.el9)"}
!337 = distinct !DISubprogram(name: "balancer", scope: !3, file: !3, line: 237, type: !338, scopeLine: 238, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !340)
!338 = !DISubroutineType(types: !339)
!339 = !{!59, !269}
!340 = !{!341, !342}
!341 = !DILocalVariable(name: "ctx", arg: 1, scope: !337, file: !3, line: 237, type: !269)
!342 = !DILocalVariable(name: "____fmt", scope: !343, file: !3, line: 240, type: !344)
!343 = distinct !DILexicalBlock(scope: !337, file: !3, line: 240, column: 5)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 80, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 10)
!347 = !DILocation(line: 0, scope: !337)
!348 = !DILocation(line: 240, column: 5, scope: !343)
!349 = !DILocation(line: 240, column: 5, scope: !337)
!350 = !DILocalVariable(name: "ctx", arg: 1, scope: !351, file: !3, line: 12, type: !269)
!351 = distinct !DISubprogram(name: "process_packet", scope: !3, file: !3, line: 12, type: !338, scopeLine: 13, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !352)
!352 = !{!350, !353, !355, !359, !360, !361, !362, !363, !364, !388, !391, !398, !399, !404, !422, !423, !424, !425, !426, !434, !435, !445, !446, !447}
!353 = !DILocalVariable(name: "fmt", scope: !351, file: !3, line: 14, type: !354)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 24, elements: !132)
!355 = !DILocalVariable(name: "fmt1", scope: !351, file: !3, line: 15, type: !356)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 40, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 5)
!359 = !DILocalVariable(name: "action", scope: !351, file: !3, line: 19, type: !98)
!360 = !DILocalVariable(name: "data", scope: !351, file: !3, line: 29, type: !57)
!361 = !DILocalVariable(name: "data_end", scope: !351, file: !3, line: 30, type: !57)
!362 = !DILocalVariable(name: "ip4_hdr", scope: !351, file: !3, line: 32, type: !81)
!363 = !DILocalVariable(name: "port", scope: !351, file: !3, line: 37, type: !164)
!364 = !DILocalVariable(name: "tcp_hdr", scope: !365, file: !3, line: 39, type: !367)
!365 = distinct !DILexicalBlock(scope: !366, file: !3, line: 38, column: 33)
!366 = distinct !DILexicalBlock(scope: !351, file: !3, line: 38, column: 9)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !369, line: 25, size: 160, elements: !370)
!369 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !368, file: !369, line: 26, baseType: !71, size: 16)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !368, file: !369, line: 27, baseType: !71, size: 16, offset: 16)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !368, file: !369, line: 28, baseType: !97, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !368, file: !369, line: 29, baseType: !97, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !368, file: !369, line: 31, baseType: !73, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !368, file: !369, line: 32, baseType: !73, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !368, file: !369, line: 33, baseType: !73, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !368, file: !369, line: 34, baseType: !73, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !368, file: !369, line: 35, baseType: !73, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !368, file: !369, line: 36, baseType: !73, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !368, file: !369, line: 37, baseType: !73, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !368, file: !369, line: 38, baseType: !73, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !368, file: !369, line: 39, baseType: !73, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !368, file: !369, line: 40, baseType: !73, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !368, file: !369, line: 55, baseType: !71, size: 16, offset: 112)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !368, file: !369, line: 56, baseType: !95, size: 16, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !368, file: !369, line: 57, baseType: !71, size: 16, offset: 144)
!388 = !DILocalVariable(name: "udp_hdr", scope: !389, file: !3, line: 44, type: !100)
!389 = distinct !DILexicalBlock(scope: !390, file: !3, line: 43, column: 41)
!390 = distinct !DILexicalBlock(scope: !366, file: !3, line: 43, column: 16)
!391 = !DILocalVariable(name: "binds_key", scope: !351, file: !3, line: 52, type: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "binds_row_key", file: !168, line: 117, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 113, size: 56, elements: !394)
!394 = !{!395, !396, !397}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !393, file: !168, line: 114, baseType: !160, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !393, file: !168, line: 115, baseType: !164, size: 16, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !393, file: !168, line: 116, baseType: !77, size: 8, offset: 48)
!398 = !DILocalVariable(name: "backends_key", scope: !351, file: !3, line: 60, type: !160)
!399 = !DILocalVariable(name: "____fmt", scope: !400, file: !3, line: 65, type: !401)
!400 = distinct !DILexicalBlock(scope: !351, file: !3, line: 65, column: 5)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 280, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 35)
!404 = !DILocalVariable(name: "c", scope: !351, file: !3, line: 68, type: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_context", file: !407, line: 24, size: 704, elements: !408)
!407 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/home/conor/Workspace/College/fyp/src/balancer-xdp")
!408 = !{!409, !410, !411, !413, !414, !415, !416, !417, !418, !419, !420, !421}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "packet_start", scope: !406, file: !407, line: 25, baseType: !76, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "packet_end", scope: !406, file: !407, line: 26, baseType: !76, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "backends_key", scope: !406, file: !407, line: 27, baseType: !412, size: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "orig_eth_type", scope: !406, file: !407, line: 28, baseType: !73, size: 16, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "orig_ip_type", scope: !406, file: !407, line: 29, baseType: !164, size: 16, offset: 208)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "orig_ip4_hdr", scope: !406, file: !407, line: 30, baseType: !81, size: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "orig_ip6_hdr", scope: !406, file: !407, line: 31, baseType: !124, size: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "eth_hdr", scope: !406, file: !407, line: 32, baseType: !60, size: 64, offset: 384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dest_ip4", scope: !406, file: !407, line: 33, baseType: !98, size: 32, offset: 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ip4_hdr", scope: !406, file: !407, line: 34, baseType: !81, size: 64, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "gue_hdr", scope: !406, file: !407, line: 35, baseType: !108, size: 64, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "udp_hdr", scope: !406, file: !407, line: 36, baseType: !100, size: 64, offset: 640)
!422 = !DILocalVariable(name: "ok", scope: !351, file: !3, line: 74, type: !59)
!423 = !DILocalVariable(name: "hashingKey1", scope: !351, file: !3, line: 106, type: !157)
!424 = !DILocalVariable(name: "hashingKey2", scope: !351, file: !3, line: 107, type: !157)
!425 = !DILocalVariable(name: "hash", scope: !351, file: !3, line: 108, type: !157)
!426 = !DILocalVariable(name: "backends_row", scope: !351, file: !3, line: 109, type: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "bind_backends_row", file: !168, line: 101, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 99, size: 64, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !429, file: !168, line: 100, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "bind_backends_inner_row", file: !168, line: 100, flags: DIFlagFwdDecl)
!434 = !DILocalVariable(name: "hashToIndex", scope: !351, file: !3, line: 113, type: !160)
!435 = !DILocalVariable(name: "backends_inner_row", scope: !351, file: !3, line: 119, type: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "bind_backends_inner_row", file: !168, line: 94, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 91, size: 32, elements: !439)
!439 = !{!440, !441}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ethernetIndex", scope: !438, file: !168, line: 92, baseType: !160, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ips", scope: !438, file: !168, line: 93, baseType: !442, offset: 32)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: -1)
!445 = !DILocalVariable(name: "fib_params", scope: !351, file: !3, line: 181, type: !284)
!446 = !DILocalVariable(name: "rc", scope: !351, file: !3, line: 193, type: !59)
!447 = !DILabel(scope: !351, name: "out", file: !3, line: 231)
!448 = !DILocation(line: 0, scope: !351, inlinedAt: !449)
!449 = distinct !DILocation(line: 242, column: 12, scope: !337)
!450 = !DILocation(line: 29, column: 37, scope: !351, inlinedAt: !449)
!451 = !{!452, !453, i64 0}
!452 = !{!"xdp_md", !453, i64 0, !453, i64 4, !453, i64 8, !453, i64 12, !453, i64 16, !453, i64 20}
!453 = !{!"int", !454, i64 0}
!454 = !{!"omnipotent char", !455, i64 0}
!455 = !{!"Simple C/C++ TBAA"}
!456 = !DILocation(line: 29, column: 26, scope: !351, inlinedAt: !449)
!457 = !DILocation(line: 29, column: 18, scope: !351, inlinedAt: !449)
!458 = !DILocation(line: 30, column: 41, scope: !351, inlinedAt: !449)
!459 = !{!452, !453, i64 4}
!460 = !DILocation(line: 30, column: 30, scope: !351, inlinedAt: !449)
!461 = !DILocation(line: 33, column: 17, scope: !462, inlinedAt: !449)
!462 = distinct !DILexicalBlock(scope: !351, file: !3, line: 33, column: 9)
!463 = !DILocation(line: 33, column: 23, scope: !462, inlinedAt: !449)
!464 = !DILocation(line: 33, column: 21, scope: !462, inlinedAt: !449)
!465 = !DILocation(line: 33, column: 9, scope: !351, inlinedAt: !449)
!466 = !DILocation(line: 38, column: 18, scope: !366, inlinedAt: !449)
!467 = !{!468, !454, i64 9}
!468 = !{!"iphdr", !454, i64 0, !454, i64 0, !454, i64 1, !469, i64 2, !469, i64 4, !469, i64 6, !454, i64 8, !454, i64 9, !469, i64 10, !453, i64 12, !453, i64 16}
!469 = !{!"short", !454, i64 0}
!470 = !DILocation(line: 38, column: 9, scope: !351, inlinedAt: !449)
!471 = !DILocation(line: 0, scope: !365, inlinedAt: !449)
!472 = !DILocation(line: 40, column: 21, scope: !473, inlinedAt: !449)
!473 = distinct !DILexicalBlock(scope: !365, file: !3, line: 40, column: 13)
!474 = !DILocation(line: 40, column: 27, scope: !473, inlinedAt: !449)
!475 = !DILocation(line: 40, column: 25, scope: !473, inlinedAt: !449)
!476 = !DILocation(line: 40, column: 13, scope: !365, inlinedAt: !449)
!477 = !DILocation(line: 0, scope: !389, inlinedAt: !449)
!478 = !DILocation(line: 45, column: 21, scope: !479, inlinedAt: !449)
!479 = distinct !DILexicalBlock(scope: !389, file: !3, line: 45, column: 13)
!480 = !DILocation(line: 45, column: 27, scope: !479, inlinedAt: !449)
!481 = !DILocation(line: 45, column: 25, scope: !479, inlinedAt: !449)
!482 = !DILocation(line: 45, column: 13, scope: !389, inlinedAt: !449)
!483 = !DILocation(line: 0, scope: !366, inlinedAt: !449)
!484 = !DILocation(line: 52, column: 5, scope: !351, inlinedAt: !449)
!485 = !DILocation(line: 52, column: 19, scope: !351, inlinedAt: !449)
!486 = !DILocation(line: 52, column: 31, scope: !351, inlinedAt: !449)
!487 = !DILocation(line: 53, column: 40, scope: !351, inlinedAt: !449)
!488 = !{!468, !453, i64 16}
!489 = !DILocalVariable(name: "__bsx", arg: 1, scope: !490, file: !491, line: 49, type: !161)
!490 = distinct !DISubprogram(name: "__bswap_32", scope: !491, file: !491, line: 49, type: !492, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !494)
!491 = !DIFile(filename: "/usr/include/bits/byteswap.h", directory: "")
!492 = !DISubroutineType(types: !493)
!493 = !{!161, !161}
!494 = !{!489}
!495 = !DILocation(line: 0, scope: !490, inlinedAt: !496)
!496 = distinct !DILocation(line: 53, column: 20, scope: !351, inlinedAt: !449)
!497 = !DILocation(line: 54, column: 10, scope: !490, inlinedAt: !496)
!498 = !{!499, !453, i64 0}
!499 = !{!"", !453, i64 0, !469, i64 4, !454, i64 6}
!500 = !{!499, !469, i64 4}
!501 = !{!499, !454, i64 6}
